# Задание 6_1
# Имеется список с произвольными данными. Поставлена задача проеобразовать его в множество


my_list = [1, 2, "a", 3, 2, "b", "c"]

my_set = set(my_list)

print(my_set)