# Задание 4_2
# Введите строку с клавиатуры и посчитайте, сколько в ней заглавных букв "О"


user_input = input("Введите строку: ")

count_O = user_input.count("О")

print(f"Количество заглавных 'О' в введенной строке равно {count_O}")
