# Задание 2_2
# Вывести на экран все чётные значения в диапазоне от 2 до 248.


print("Чётные значения:\n", [i for i in range(2, 249, 2)])
