# Задание 1_1
# Составьте программу, вычисляющую скорость прямолинейного равномерного движения тела по указанным значениям перемещения
# и времени, в течение которого это перемещение совершено.


s = float(input("Введите значение перемещения (в метрах): "))
t = float(input("Введите значение времени (в секундах): "))

print(f"Скорость прямолинейного равномерного движения: {s / t} м/с")
