# Задание 6_3
# Даны 2 множества. Объедините их.

set1 = {1, 2, 3}
set2 = {3, 4, 5}

result_set = set1.union(set2)

print(result_set)
